app/controllers/school_classes_controller.rb

  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(school_class_params(:title, :room_number))
---
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 310], ["updated_at", "2017-05-01 23:02:26.564900"], ["id", 2]]